nxp-mcuxpresso/mcux-soc-svd/LPC54S016/LPC54S016.xml
        <register>
          <name>ISO_PTD_DONE_MAP</name>
          <description>Done map for each ISO PTD</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISO_DONE</name>
              <description>The bit corresponding to a certain PTD will be set to logic 1 as soon as that PTD execution is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISO_PTD_SKIP_MAP</name>
          <description>Skip map for each ISO PTD</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISO_SKIP</name>
              <description>The bit corresponding to a certain PTD will be set to logic 1 as soon as that PTD execution is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_PTD_DONE_MAP</name>
          <description>Done map for each INT PTD</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INT_DONE</name>
              <description>The bit corresponding to a certain PTD will be set to logic 1 as soon as that PTD execution is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_PTD_SKIP_MAP</name>
          <description>Skip map for each INT PTD</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INT_SKIP</name>
              <description>When a bit in the PTD Skip Map is set to logic 1, the corresponding PTD will be skipped, independent of the V bit setting.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LASTPTD</name>
          <description>Marks the last PTD in the list for ISO, INT and ATL</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1F1F1F</resetMask>
          <fields>
            <field>
              <name>ATL_LAST</name>
              <description>If hardware has reached this PTD and the J bit is not set, it will go to PTD0 as the next PTD to be processed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISO_LAST</name>
              <description>This indicates the last PTD in the ISO list.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_LAST</name>
              <description>This indicates the last PTD in the INT list.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTMODE</name>
          <description>Controls the port if it is attached to the host block or the device block</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000</resetValue>
          <resetMask>0xD0101</resetMask>
          <fields>
            <field>
              <name>ID0</name>
              <description>Port 0 ID pin value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ID0_EN</name>
              <description>Port 0 ID pin pull-up enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEV_ENABLE</name>
              <description>If this bit is set to one, one of the ports will behave as a USB device.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_CTRL_PDCOM</name>
              <description>This bit indicates if the PHY power-down input is controlled by software or by hardware.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_PDCOM</name>
              <description>This bit is only used when SW_CTRL_PDCOM is set to 1b.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
